/**
  ******************************************************************************
  *	@file  	 	lcd_fonts.h
  *	@version 	V1.0
  * @date    	2021-06-01
  *	@author  	知行科技
  *	@brief   	字模数据，可自行添加或删减
  ******************************************************************************
  * @attention
  *
  *	实验平台：STM32核心板M2 
  *
>>>>> 文件说明：
  *
  *	1.ASCII字符集: !"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~
  *	2.ASCII字模，总共有5种大小的字模：3216、2412、2010、1608、1206，皆是宋体
  *	3.中文字模也有五种大小：3232、2424、2020、1616、1212
  *	4.中文字库是小字库，也就是用到了相应的汉字再取模
  *	5.中文字库每个字模后面都必须要有一个对应的汉字作为索引
  *
>>>>> 取模方式说明：
  *
  *	1.取模软件 PCtolCD2018
  *	2.阴码、逆向、逐行式、C51格式、像素大小8、注释前段【{"】、注释后段【"},/8*】。
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FONTS_H
#define __FONTS_H

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>

/* Exported types ------------------------------------------------------------*/
// 字体相关结构定义
typedef struct _pFont
{    
	const uint8_t 		*pTable;  		//	字模数组地址
	uint16_t 			Width; 		 	//	单个字符的字模宽度
	uint16_t 			Height; 			//	单个字符的字模长度
	uint16_t 			Sizes;	 		//	单个字符的字模数据个数
	uint16_t				Table_Rows;		// 该参数只有汉字字模用到，表示二维数组的行大小
} pFONT;

/* Exported constants --------------------------------------------------------*/
/*------------------------------------ 中文字体 ---------------------------------------------*/

extern	pFONT	CH_Font12 ;		//	1212字体
extern	pFONT	CH_Font16 ;    //	1616字体
extern	pFONT	CH_Font20 ;    //	2020字体
extern	pFONT	CH_Font24 ;    //	2424字体
extern	pFONT	CH_Font32 ;    //	3232字体

/*------------------------------------ ASCII字体 ---------------------------------------------*/

extern pFONT Font32;	// 3216 字体
extern pFONT Font24;	// 2412 字体
extern pFONT Font20; // 2010 字体
extern pFONT Font16; // 1608 字体
extern pFONT Font12; // 1206 字体

#endif 
 
